server/app/services/books_services/get_book.rb

SELECT "books".* FROM "books" WHERE "books"."isbn" = $1 LIMIT $2  [["isbn", "9781891830853"], ["LIMIT", 1]]
---
    def book
      Book.find(Booker::Isbn.as_isbn13(params[:id]))